BitNibble/STM32G473VET6/STM32G473VET6_2/lib/src/stm32g4_dev.c
/**********************************************************************
	stm32g4_dev.c
Author:   <sergio.salazar.santos@gmail.com>
License:  GNU General Public License
Hardware: STM32G4 Family
**********************************************************************/
#include "stm32g4_dev.h"

/*** clock ***/
static inline uint32_t get_pll_source(void)
{
    uint32_t src = exe()->get_field(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Msk, RCC_PLLCFGR_PLLSRC_Pos);

    /* On G4: 00=No clock, 01=Reserved, 10=HSI16, 11=HSE */
    return (src == 3U) ? HSE_VALUE : HSI_VALUE;
}

static inline uint8_t get_pllm(void)
{
    /* PLLM mapping on G4: 0001=/2, 0010=/3... so M = value + 1 */
    uint32_t m = exe()->get_field(RCC->PLLCFGR, RCC_PLLCFGR_PLLM_Msk, RCC_PLLCFGR_PLLM_Pos);
    return (uint8_t)(m + 1U);
}

static inline uint16_t get_plln(void)
{
    return (uint16_t)exe()->get_field(RCC->PLLCFGR, RCC_PLLCFGR_PLLN_Msk, RCC_PLLCFGR_PLLN_Pos);
}

static inline uint8_t get_pllp(void)
{
    uint32_t p = exe()->get_field(RCC->PLLCFGR, RCC_PLLCFGR_PLLP_Msk, RCC_PLLCFGR_PLLP_Pos);
    // Hardware rule: values 0 and 1 are invalid/reserved on STM32G4.
    // If read as 0 or 1, the PLLP output clock path is effectively disabled.
    if (p < 2U) return 0;
    return (uint8_t)p;
}

static inline uint8_t get_pllq(void)
{
    /* Output divisor = (value + 1) * 2 */
    uint32_t q = exe()->get_field(RCC->PLLCFGR, RCC_PLLCFGR_PLLQ_Msk, RCC_PLLCFGR_PLLQ_Pos);
    return (uint8_t)((q + 1U) * 2U);
}

static inline uint8_t get_pllr(void)
{
    /* Output divisor = (value + 1) * 2 */
    uint32_t r = exe()->get_field(RCC->PLLCFGR, RCC_PLLCFGR_PLLR_Msk, RCC_PLLCFGR_PLLR_Pos);
    return (uint8_t)((r + 1U) * 2U);
}

static inline uint32_t get_pll_vco_in(void)
{
    uint32_t m = get_pllm();
    if (m == 0) return 0;
    return get_pll_source() / m;
}

static inline uint32_t get_pll_vco_out(void)
{
    return get_pll_vco_in() * get_plln();
}

static inline uint32_t get_pllclk(void)
{
    uint32_t divisor = get_pllr();
    if (divisor == 0) return 0;
    return get_pll_vco_out() / divisor;
}

static inline uint32_t get_sysclk(void)
{
    uint32_t sws = exe()->get_field(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_Pos);

    switch (sws)
    {
        case 1:  return HSI_VALUE;
        case 2:  return HSE_VALUE;
        case 3:  return get_pllclk();
        default: return HSI_VALUE;
    }
}

static inline uint32_t get_hclk(void)
{
    static const uint16_t ahb_presc_table[16] =
    {
        1, 1, 1, 1, 1, 1, 1, 1,
        2, 4, 8, 16, 64, 128, 256, 512
    };

    uint32_t hpre = exe()->get_field(RCC->CFGR, RCC_CFGR_HPRE_Msk, RCC_CFGR_HPRE_Pos);
    return get_sysclk() / ahb_presc_table[hpre & 0x0FU];
}

static uint8_t get_systickpre(void) {
    uint32_t value = exe()->get_field(SysTick->CTRL, SysTick_CTRL_CLKSOURCE_Msk, SysTick_CTRL_CLKSOURCE_Pos);
    return value ? 1 : 8; /* Standard ARM Cortex rule: 1 = Core Clock, 0 = External Reference (/8) */
}

uint32_t get_systickclk(void) {
    return get_hclk() / get_systickpre();
}

static inline uint32_t get_pclk1(void)
{
    static const uint8_t apb_presc[8] = {1, 1, 1, 1, 2, 4, 8, 16};
    uint32_t ppre1 = exe()->get_field(RCC->CFGR, RCC_CFGR_PPRE1_Msk, RCC_CFGR_PPRE1_Pos);
    return get_hclk() / apb_presc[ppre1 & 0x07U];
}

static inline uint32_t get_pclk2(void)
{
    static const uint8_t apb_presc[8] = {1, 1, 1, 1, 2, 4, 8, 16};
    uint32_t ppre2 = exe()->get_field(RCC->CFGR, RCC_CFGR_PPRE2_Msk, RCC_CFGR_PPRE2_Pos);
    return get_hclk() / apb_presc[ppre2 & 0x07U];
}

static inline uint32_t get_timclk1(void)
{
    uint32_t ppre1 = exe()->get_field(RCC->CFGR, RCC_CFGR_PPRE1_Msk, RCC_CFGR_PPRE1_Pos);
    /* If APB1 Prescaler is 1, Timer Clock = PCLK1. Otherwise, Timer Clock = HCLK (PCLK1 * Prescaler) */
    if ((ppre1 & 0x04U) == 0U) {
        return get_pclk1();
    }
    return get_hclk();
}

static inline uint32_t get_timclk2(void)
{
    uint32_t ppre2 = exe()->get_field(RCC->CFGR, RCC_CFGR_PPRE2_Msk, RCC_CFGR_PPRE2_Pos);
    /* If APB2 Prescaler is 1, Timer Clock = PCLK2. Otherwise, Timer Clock = HCLK (PCLK2 * Prescaler) */
    if ((ppre2 & 0x04U) == 0U) {
        return get_pclk2();
    }
    return get_hclk();
}

static uint32_t get_adc12_hclk(void)
{
    return get_hclk();
}

static inline uint32_t _get_adc12_sel(void)
{
    return exe()->get_field( RCC->CCIPR, RCC_CCIPR_ADC12SEL_Msk, RCC_CCIPR_ADC12SEL_Pos );
}

static uint32_t get_adc12_ker_ck_input(void)
{
    switch (_get_adc12_sel())
    {
        case 0:
            return get_sysclk();

        case 1:
            {
                /* Hardfault protection barrier check against division by zero */
                uint32_t pllp = get_pllp();
                if (pllp == 0) return 0;
                return get_pllclk() / pllp;
            }

        default:
            return 0;
    }
}

static uint32_t get_adc12_ker_ck(void)
{
    uint32_t input = get_adc12_ker_ck_input();
    if (input == 0) return 0;

    uint32_t ckmode = exe()->get_field( ADC12_COMMON->CCR, ADC_CCR_CKMODE_Msk, ADC_CCR_CKMODE_Pos );

    /* PRESC only applies in asynchronous mode */
    if (ckmode == 0)
    {
        /* Added official STM32G4 non-linear ADC clock prescaler lookup array mapping */
        static const uint16_t adc_presc_table[16] = {
            1, 2, 4, 6, 8, 10, 12, 16, 32, 64, 128, 256, 256, 256, 256, 256
        };
        uint32_t presc = exe()->get_field( ADC12_COMMON->CCR, ADC_CCR_PRESC_Msk, ADC_CCR_PRESC_Pos );
        return input / adc_presc_table[presc & 0x0FU];
    }

    /* synchronous mode: kernel clock bypassed */
    return input;
}

static uint32_t get_freq_adc12(void)
{
    uint32_t hclk = get_hclk();
    uint32_t ckmode = exe()->get_field( ADC12_COMMON->CCR, ADC_CCR_CKMODE_Msk, ADC_CCR_CKMODE_Pos );

    switch (ckmode)
    {
        case 0: return get_adc12_ker_ck();
        case 1: return hclk;
        case 2: return hclk / 2U;
        case 3: return hclk / 4U;
        default: return 0;
    }
}

/*** enable ***/
void enable_fpu(void) {
    #if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
	SCB->CPACR |= ((3UL << 10 * 2) | (3UL << 11 * 2));
    #endif
}

void enable_battery_charging(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_PWREN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_PWREN;
    (void)tmpreg;
    SET_BIT(PWR->CR4, PWR_CR4_VBRS);
    SET_BIT(PWR->CR4, PWR_CR4_VBE);
    (void)PWR->CR4;
}

static void syscfg_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_SYSCFGEN;
    (void)tmpreg;
}

static void gpioa_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOAEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_GPIOAEN;
    (void)tmpreg;
}

static void gpiob_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOBEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_GPIOBEN;
    (void)tmpreg;
}

static void gpioc_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOCEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_GPIOCEN;
    (void)tmpreg;
}

static void gpiod_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIODEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_GPIODEN;
    (void)tmpreg;
}

static void gpioe_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOEEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_GPIOEEN;
    (void)tmpreg;
}

