BitNibble/STM32G473VET6/STM32G473VET6_2/lib/src/stm32g4_dev.c
static void gpiof_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOFEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_GPIOFEN;
    (void)tmpreg;
}

static void gpiog_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOGEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_GPIOGEN;
    (void)tmpreg;
}

static void dma1_clock(void) {
    SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA1EN);
    volatile uint32_t tmpreg = RCC->AHB1ENR & RCC_AHB1ENR_DMA1EN;
    (void)tmpreg;
}

static void dma2_clock(void) {
    SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);
    volatile uint32_t tmpreg = RCC->AHB1ENR & RCC_AHB1ENR_DMA2EN;
    (void)tmpreg;
}

static void dmamux_clock(void) {
    SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMAMUX1EN);
    volatile uint32_t tmpreg = RCC->AHB1ENR & RCC_AHB1ENR_DMAMUX1EN;
    (void)tmpreg;
}

static void cordic_clock(void) {
    SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_CORDICEN);
    volatile uint32_t tmpreg = RCC->AHB1ENR & RCC_AHB1ENR_CORDICEN;
    (void)tmpreg;
}

static void fmac_clock(void) {
    SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_FMACEN);
    volatile uint32_t tmpreg = RCC->AHB1ENR & RCC_AHB1ENR_FMACEN;
    (void)tmpreg;
}

static void flash_clock(void) {
    SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_FLASHEN);
    volatile uint32_t tmpreg = RCC->AHB1ENR & RCC_AHB1ENR_FLASHEN;
    (void)tmpreg;
}

static void crc_clock(void) {
    SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_CRCEN);
    volatile uint32_t tmpreg = RCC->AHB1ENR & RCC_AHB1ENR_CRCEN;
    (void)tmpreg;
}

static void qspi_clock(void) {
    SET_BIT(RCC->AHB3ENR, RCC_AHB3ENR_QSPIEN);
    volatile uint32_t tmpreg = RCC->AHB3ENR & RCC_AHB3ENR_QSPIEN;
    (void)tmpreg;
}

static void fmc_clock(void) {
    SET_BIT(RCC->AHB3ENR, RCC_AHB3ENR_FMCEN);
    volatile uint32_t tmpreg = RCC->AHB3ENR & RCC_AHB3ENR_FMCEN;
    (void)tmpreg;
}

static void tim1_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_TIM1EN;
    (void)tmpreg;
}

static void tim2_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_TIM2EN;
    (void)tmpreg;
}

static void tim3_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM3EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_TIM3EN;
    (void)tmpreg;
}

static void tim4_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM4EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_TIM4EN;
    (void)tmpreg;
}

static void tim5_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM5EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_TIM5EN;
    (void)tmpreg;
}

static void tim6_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_TIM6EN;
    (void)tmpreg;
}

static void tim7_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_TIM7EN;
    (void)tmpreg;
}

static void tim8_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_TIM8EN;
    (void)tmpreg;
}

static void tim15_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_TIM15EN;
    (void)tmpreg;
}

static void tim16_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_TIM16EN;
    (void)tmpreg;
}

static void tim17_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_TIM17EN;
    (void)tmpreg;
}

static void tim20_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM20EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_TIM20EN;
    (void)tmpreg;
}

static void lptim1_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_LPTIM1EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_LPTIM1EN;
    (void)tmpreg;
}

static void usart1_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_USART1EN;
    (void)tmpreg;
}

static void usart2_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_USART2EN;
    (void)tmpreg;
}

static void usart3_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_USART3EN;
    (void)tmpreg;
}

static void uart4_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_UART4EN;
    (void)tmpreg;
}

static void uart5_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_UART5EN;
    (void)tmpreg;
}

static void i2c1_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_I2C1EN;
    (void)tmpreg;
}

static void i2c2_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_I2C2EN;
    (void)tmpreg;
}

static void i2c3_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_I2C3EN;
    (void)tmpreg;
}

static void i2c4_clock(void) {
    SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_I2C4EN);
    volatile uint32_t tmpreg = RCC->APB1ENR2 & RCC_APB1ENR2_I2C4EN;
    (void)tmpreg;
}

static void spi1_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_SPI1EN;
    (void)tmpreg;
}

static void spi2_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_SPI2EN;
    (void)tmpreg;
}

static void spi3_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_SPI3EN;
    (void)tmpreg;
}

static void spi4_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI4EN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_SPI4EN;
    (void)tmpreg;
}

static void fdcan_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_FDCANEN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_FDCANEN;
    (void)tmpreg;
}

