BitNibble/STM32G473VET6/STM32G473VET6_2/lib/src/stm32g4_dev.c
static void crs_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CRSEN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_CRSEN;
    (void)tmpreg;
}

static void usb_clock(void) {
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USBEN);
    volatile uint32_t tmpreg = RCC->APB1ENR1 & RCC_APB1ENR1_USBEN;
    (void)tmpreg;
}

static void adc12_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_ADC12EN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_ADC12EN;
    (void)tmpreg;
}

static void adc345_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_ADC345EN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_ADC345EN;
    (void)tmpreg;
}

static void dac1_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC1EN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_DAC1EN;
    (void)tmpreg;
}

static void dac2_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC2EN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_DAC2EN;
    (void)tmpreg;
}

static void dac3_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC3EN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_DAC3EN;
    (void)tmpreg;
}

static void dac4_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC4EN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_DAC4EN;
    (void)tmpreg;
}

static void enable_opamp_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_SYSCFGEN;
    (void)tmpreg;
}

static void enable_comp_clock(void) {
    SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN);
    volatile uint32_t tmpreg = RCC->APB2ENR & RCC_APB2ENR_SYSCFGEN;
    (void)tmpreg;
}

static void rng_clock(void) {
    SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_RNGEN);
    volatile uint32_t tmpreg = RCC->AHB2ENR & RCC_AHB2ENR_RNGEN;
    (void)tmpreg;
}
static void unmapped_callback(void) { }

/* ========================================================================== */
/*                      API Address Routing Mechanism                         */
/* ========================================================================== */
static void dev_peripheral_enable(const void *peripheral_base) {
    if (peripheral_base == NULL) return;

    /*
     * By casting to a uint32_t, the compiler recognizes these as contiguous
     * hardware base integers and optimizes this block into an instant O(1) jump table.
     */
    switch ((uint32_t)peripheral_base) {
        /* Core Elements */
        case SYSCFG_BASE:                 syscfg_clock();            break;
        case FLASH_BASE:                  flash_clock();             break;

        /* GPIO Subsystems */
        case GPIOA_BASE:                  gpioa_clock();             break;
        case GPIOB_BASE:                  gpiob_clock();             break;
        case GPIOC_BASE:                  gpioc_clock();             break;
        case GPIOD_BASE:                  gpiod_clock();             break;
        case GPIOE_BASE:                  gpioe_clock();             break;
        case GPIOF_BASE:                  gpiof_clock();             break;
        case GPIOG_BASE:                  gpiog_clock();             break;

        /* Core AHB1 Engines */
        case DMA1_BASE:                   dma1_clock();              break;
        case DMA2_BASE:                   dma2_clock();              break;
        case DMAMUX1_BASE:                dmamux_clock();            break;
        case CORDIC_BASE:                 cordic_clock();            break;
        case FMAC_BASE:                   fmac_clock();              break;
        case CRC_BASE:                    crc_clock();               break;

        /* Storage Bus Subsystems */
        case QSPI_BASE:                   qspi_clock();              break;
        case FMC_Bank1_R_BASE:            fmc_clock();               break;

        /* APB2 High Performance Timers */
        case TIM1_BASE:                   tim1_clock();              break;
        case TIM8_BASE:                   tim8_clock();              break;
        case TIM15_BASE:                  tim15_clock();             break;
        case TIM16_BASE:                  tim16_clock();             break;
        case TIM17_BASE:                  tim17_clock();             break;
        case TIM20_BASE:                  tim20_clock();             break;

        /* APB1 Standard Timers */
        case TIM2_BASE:                   tim2_clock();              break;
        case TIM3_BASE:                   tim3_clock();              break;
        case TIM4_BASE:                   tim4_clock();              break;
        case TIM5_BASE:                   tim5_clock();              break;
        case TIM6_BASE:                   tim6_clock();              break;
        case TIM7_BASE:                   tim7_clock();              break;
        case LPTIM1_BASE:                 lptim1_clock();            break;

        /* Communications Lines Matrix */
        case USART1_BASE:                 usart1_clock();            break;
        case USART2_BASE:                 usart2_clock();            break;
        case USART3_BASE:                 usart3_clock();            break;
        case UART4_BASE:                  uart4_clock();             break;
        case UART5_BASE:                  uart5_clock();             break;

        /* I2C Direct Blocks */
        case I2C1_BASE:                   i2c1_clock();              break;
        case I2C2_BASE:                   i2c2_clock();              break;
        case I2C3_BASE:                   i2c3_clock();              break;
        case I2C4_BASE:                   i2c4_clock();              break;

        /* SPI Standard Buses */
        case SPI1_BASE:                   spi1_clock();              break;
        case SPI2_BASE:                   spi2_clock();              break;
        case SPI3_BASE:                   spi3_clock();              break;
        case SPI4_BASE:                   spi4_clock();              break;

        /* Interconnectivity Channels */
        case FDCAN1_BASE:                 fdcan_clock();             break;
        case CRS_BASE:                    crs_clock();               break;
        case USB_BASE:                    usb_clock();               break;

        /* Analog Converters Base Elements */
        case ADC1_BASE: /* fallthrough */
        case ADC2_BASE:                   adc12_clock();             break;
        case ADC3_BASE: /* fallthrough */
        case ADC4_BASE: /* fallthrough */
        case ADC5_BASE:                   adc345_clock();            break;
        case DAC1_BASE:                   dac1_clock();              break;
        case DAC2_BASE:                   dac2_clock();              break;
        case DAC3_BASE:                   dac3_clock();              break;
        case DAC4_BASE:                   dac4_clock();              break;
        case RNG_BASE:                    rng_clock();               break;

        default:
            unmapped_callback();
        break;
    }

    /* Force register flush synchronization */
    __DSB();
}

