BitNibble/STM32G473VET6/STM32G473VET6_2/lib/src/stm32g4_dev.c
/*** disable ***/
/* ========================================================================== */
/*            Private Static Core & Peripheral Clock Disable Functions        */
/* ========================================================================== */
static void disable_fpu(void)                 { SCB->CPACR &= ~((3UL << 10*2)|(3UL << 11*2)); }
static void disable_battery_charging(void)    { CLEAR_BIT(PWR->CR4, PWR_CR4_VBE | PWR_CR4_VBRS); }
static void syscfg_clock_disable(void)        { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN); }

static void gpioa_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOAEN); }
static void gpiob_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOBEN); }
static void gpioc_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOCEN); }
static void gpiod_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIODEN); }
static void gpioe_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOEEN); }
static void gpiof_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOFEN); }
static void gpiog_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_GPIOGEN); }

static void dma1_clock_disable(void)          { CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA1EN); }
static void dma2_clock_disable(void)          { CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN); }
static void dmamux_clock_disable(void)        { CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMAMUX1EN); }
static void cordic_clock_disable(void)        { CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_CORDICEN); }
static void fmac_clock_disable(void)          { CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_FMACEN); }
static void flash_clock_disable(void)         { CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_FLASHEN); }
static void crc_clock_disable(void)           { CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_CRCEN); }

static void qspi_clock_disable(void)          { CLEAR_BIT(RCC->AHB3ENR, RCC_AHB3ENR_QSPIEN); }
static void fmc_clock_disable(void)           { CLEAR_BIT(RCC->AHB3ENR, RCC_AHB3ENR_FMCEN); }

static void tim1_clock_disable(void)          { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN); }
static void tim8_clock_disable(void)          { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN); }
static void tim15_clock_disable(void)         { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN); }
static void tim16_clock_disable(void)         { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN); }
static void tim17_clock_disable(void)         { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN); }
static void tim20_clock_disable(void)         { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM20EN); }

static void tim2_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN); }
static void tim3_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM3EN); }
static void tim4_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM4EN); }
static void tim5_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM5EN); }
static void tim6_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN); }
static void tim7_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN); }
static void lptim1_clock_disable(void)        { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_LPTIM1EN); }

static void usart1_clock_disable(void)        { CLEAR_BIT(RCC->APB2ENR,  RCC_APB2ENR_USART1EN); }
static void usart2_clock_disable(void)        { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN); }
static void usart3_clock_disable(void)        { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN); }
static void uart4_clock_disable(void)         { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN); }
static void uart5_clock_disable(void)         { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN); }

static void i2c1_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN); }
static void i2c2_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN); }
static void i2c3_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN); }
static void i2c4_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_I2C4EN); }

static void spi1_clock_disable(void)          { CLEAR_BIT(RCC->APB2ENR,  RCC_APB2ENR_SPI1EN); }
static void spi2_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN); }
static void spi3_clock_disable(void)          { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN); }
static void spi4_clock_disable(void)          { CLEAR_BIT(RCC->APB2ENR,  RCC_APB2ENR_SPI4EN); }

static void fdcan_clock_disable(void)         { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_FDCANEN); }
static void crs_clock_disable(void)           { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CRSEN); }
static void usb_clock_disable(void)           { CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USBEN); }

static void adc12_clock_disable(void)         { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_ADC12EN); }
static void adc345_clock_disable(void)        { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_ADC345EN); }
static void dac1_clock_disable(void)          { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC1EN); }
static void dac2_clock_disable(void)          { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC2EN); }
static void dac3_clock_disable(void)          { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC3EN); }
static void dac4_clock_disable(void)          { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_DAC4EN); }

static void disable_opamp_clock(void)         { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN); }
static void disable_comp_clock(void)          { CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN); }

static void rng_clock_disable(void)           { CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_RNGEN); }

/* ========================================================================== */
/*                      API Address Disable Routing Mechanism                 */
/* ========================================================================== */
static void dev_peripheral_disable(const void *peripheral_base) {
    if (peripheral_base == NULL) return;

    switch ((uint32_t)peripheral_base) {
        /* Core Elements */
        case SYSCFG_BASE:                 syscfg_clock_disable();        break;
        case FLASH_BASE:                  flash_clock_disable();         break;

        /* GPIO Subsystems */
        case GPIOA_BASE:                  gpioa_clock_disable();         break;
        case GPIOB_BASE:                  gpiob_clock_disable();         break;
        case GPIOC_BASE:                  gpioc_clock_disable();         break;
        case GPIOD_BASE:                  gpiod_clock_disable();         break;
        case GPIOE_BASE:                  gpioe_clock_disable();         break;
        case GPIOF_BASE:                  gpiof_clock_disable();         break;
        case GPIOG_BASE:                  gpiog_clock_disable();         break;

        /* Core AHB1 Engines */
        case DMA1_BASE:                   dma1_clock_disable();          break;
        case DMA2_BASE:                   dma2_clock_disable();          break;
        case DMAMUX1_BASE:                dmamux_clock_disable();        break;
        case CORDIC_BASE:                 cordic_clock_disable();        break;
        case FMAC_BASE:                   fmac_clock_disable();          break;
        case CRC_BASE:                    crc_clock_disable();           break;

        /* Storage Bus Subsystems */
        case QSPI_BASE:                   qspi_clock_disable();          break;
        case FMC_Bank1_R_BASE:            fmc_clock_disable();           break;

