BitNibble/STM32G473VET6/STM32G473VET6_2/lib/src/stm32g4_dev.c
        /* APB2 High Performance Timers */
        case TIM1_BASE:                   tim1_clock_disable();          break;
        case TIM8_BASE:                   tim8_clock_disable();          break;
        case TIM15_BASE:                  tim15_clock_disable();         break;
        case TIM16_BASE:                  tim16_clock_disable();         break;
        case TIM17_BASE:                  tim17_clock_disable();         break;
        case TIM20_BASE:                  tim20_clock_disable();         break;

        /* APB1 Standard Timers */
        case TIM2_BASE:                   tim2_clock_disable();          break;
        case TIM3_BASE:                   tim3_clock_disable();          break;
        case TIM4_BASE:                   tim4_clock_disable();          break;
        case TIM5_BASE:                   tim5_clock_disable();          break;
        case TIM6_BASE:                   tim6_clock_disable();          break;
        case TIM7_BASE:                   tim7_clock_disable();          break;
        case LPTIM1_BASE:                 lptim1_clock_disable();        break;

        /* Communications Lines Matrix */
        case USART1_BASE:                 usart1_clock_disable();        break;
        case USART2_BASE:                 usart2_clock_disable();        break;
        case USART3_BASE:                 usart3_clock_disable();        break;
        case UART4_BASE:                  uart4_clock_disable();         break; /*  FIXED: Changed from uart4_clock() */
        case UART5_BASE:                  uart5_clock_disable();         break; /*  FIXED: Changed from uart5_clock() */

        /* I2C Direct Blocks */
        case I2C1_BASE:                   i2c1_clock_disable();          break;
        case I2C2_BASE:                   i2c2_clock_disable();          break;
        case I2C3_BASE:                   i2c3_clock_disable();          break;
        case I2C4_BASE:                   i2c4_clock_disable();          break;

        /* SPI Standard Buses */
        case SPI1_BASE:                   spi1_clock_disable();          break;
        case SPI2_BASE:                   spi2_clock_disable();          break;
        case SPI3_BASE:                   spi3_clock_disable();          break;
        case SPI4_BASE:                   spi4_clock_disable();          break;

        /* Interconnectivity Channels */
        case FDCAN1_BASE:                 fdcan_clock_disable();         break;
        case CRS_BASE:                    crs_clock_disable();           break;
        case USB_BASE:                    usb_clock_disable();           break;

        /* Analog Converters Base Elements */
        case ADC1_BASE: /* fallthrough */
        case ADC2_BASE:                   adc12_clock_disable();         break;
        case ADC3_BASE: /* fallthrough */
        case ADC4_BASE: /* fallthrough */
        case ADC5_BASE:                   adc345_clock_disable();        break;
        case DAC1_BASE:                   dac1_clock_disable();          break;
        case DAC2_BASE:                   dac2_clock_disable();          break;
        case DAC3_BASE:                   dac3_clock_disable();          break;
        case DAC4_BASE:                   dac4_clock_disable();          break;
        case RNG_BASE:                    rng_clock_disable();           break;

        default:
            unmapped_callback();
        break;
    }

    /* Force register flush synchronization to guarantee write completion */
    __DSB();
}

/*** clock ***/
static DEV_get get_setup = {
	.pll_source = get_pll_source,
	.pllm = get_pllm,
	.plln = get_plln,
	.pllp = get_pllp,
	.pllq = get_pllq,
	.pllr = get_pllr,
	.pll_vco_in = get_pll_vco_in,
	.pll_vco_out = get_pll_vco_out,
	.pllclk = get_pllclk,
	.sysclk = get_sysclk,
	.hclk = get_hclk,
	.systickclk = get_systickclk,
	.pclk1 = get_pclk1,
	.pclk2 = get_pclk2,
	.timclk1 = get_timclk1,
	.timclk2 = get_timclk2,
	.adc12_hclk = get_adc12_hclk,
	.adc12_ker_ck_input = get_adc12_ker_ck_input,
	.adc12_ker_ck = get_adc12_ker_ck,
	.freq_adc12 = get_freq_adc12
};

/*** generic ***/
static DEV_run run_setup = {
	.fpu = enable_fpu,
	.battery_charging = enable_battery_charging,
	.disable_fpu = disable_fpu,
	.disable_battery_charging = disable_battery_charging,
	.enable_opamp_clock = enable_opamp_clock,
	.enable_comp_clock = enable_comp_clock,
	.disable_opamp_clock = disable_opamp_clock,
	.disable_comp_clock = disable_comp_clock
};

/*** DEV HANDLER ***/
static STM32_DEVICE device = {
	.get = &get_setup,
	.enable = dev_peripheral_enable,
	.disable = dev_peripheral_disable,
	.run = &run_setup
};

/*** DEV ACCESSOR FUNCTION ***/
STM32_DEVICE* dev(void) { return &device; }

/*** EOF ***/

